
/**
*Oriented Object：面向对象
*/
public class TestOriented{

	public static void main(String[] args) {
		
	}
}

/*概述：

1. 类
   1.1 接口：完全抽象
   1.2 抽象类：抽象和实现都有

   1.3 管理：
       1.3.1 package
       1.3.2 import
       1.3.3 JDK的主要包

   1.4 包含：
       1.4.1 类的属性
       1.4.2 类的方法：
             1.4.2.1 方法的重载
             1.4.2.2 构建方法的重载
       1.4.3 类的构建方法

2. 对象
   2.1 引用类型
   2.2 this
   2.3 static
   2.4 内存结构

3. 面向对象的三大基本特征
   3.1 继承
       3.1.1 Object
       3.1.2 super
       3.1.3 方法重写
       3.1.4 组合

   3.2 封装 
       public,default,proteced,private

   3.3 多态

*/

/*面向过程Vs面向对象

1. 区别
   面向过程：事物比较简单，可以用线性思维去解决（第一步做什么，接下来做什么...)
   面向对象：事物比较复杂，使用简单的线性思维无法解决

2. 共同点
   2.1 面向过程和面向对象都是解决实际问题的一种思维方式
   2.2 二者相辅相成，并不是对立的。
       解决复杂问题，通过面向对象可以方便我们从宏观上把握复杂的关系，
       便于我们分析整个系统；具体到微观操作，仍然使用面向过程方式来处理。
*/