/*锤子剪刀布 (20)

题目描述
大家应该都会玩“锤子剪刀布”的游戏：

现给出两人的交锋记录，请统计双方的胜、平、负次数，并且给出双方分别出什么手势的胜算最大。

输入描述:
输入第1行给出正整数N（<=105），即双方交锋的次数。随后N行，每行给出一次交锋的信息，即甲、乙双方同时给出的的手势。C代表“锤子”、J代表“剪刀”、B代

表“布”，第1个字母代表甲方，第2个代表乙方，中间有1个空格。


输出描述:
输出第1、2行分别给出甲、乙的胜、平、负次数，数字间以1个空格分隔。第3行给出两个字母，分别代表甲、乙获胜次数最多的手势，中间有1个空格。如果解不唯

一，则输出按字母序最小的解。

输入例子:
10

C J

J B

C B

B B

B C

C C

C B

J B

B C

J J

输出例子:
5 3 2

2 3 5

B B
*/

#include <iostream>

using namespace std;

int main()
{

	int n;

	cin>>n;

	int s=0, q=0, f=0;  //甲的胜负情况
	int c1=0, j1=0, b1=0;  //甲的胜场分布
	int c2=0, j2=0, b2=0;  //乙的胜场分布

	char a, b;
	for (int i = 0; i < n; ++i)
	{
		cin>>a>>b;

		switch(a){
			case 'C':
			    if (b=='J')
			    {
			    	s++;
			    	c1++;
			    }
			    if (b=='B')
			    {
			    	f++;
			    	b2++;
			    }
			    if (b=='C')
			    {
			    	q++;
			    }
			    break;
			case 'J':
			    if (b=='C')
			    {
			    	f++;
			    	c2++;
			    }
			    if (b=='B')
			    {
			    	s++;
			    	j1++;
			    }
			    if (b=='J')
			    {
			    	q++;
			    }
			    break;
			case 'B':
			    if (b=='C')
			    {
			    	s++;
			    	b1++;
			    }
			    if (b=='J')
			    {
			    	f++;
			    	j2++;
			    }
			    if (b=='B')
			    {
			    	q++;
			    }
			    break;
			default:
			    break;
		}
	}

	cout<<s<<" "<<q<<" "<<f<<endl;
	cout<<f<<" "<<q<<" "<<s<<endl;  //甲乙胜负对称

	cout <<((((b1 >= c1) ? b1 : c1) >= j1) ? ((b1 >= c1) ? 'B': 'C') : 'J')
	     <<" "<< ((((b2 >= c2) ? b2 : c2) >= j2) ? ((b2 >= c2) ? 'B': 'C') : 'J');

	return 0;
}